07-rails/goodfoodhunting/app/views/dishes/_dish_card.html.erb

  <div class="content">
    <span class="likes-count right"><%=dish.likes.count%></span>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 4]]