07-rails/goodfoodhunting/app/controllers/dishes_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]
---
  def destroy
    dish = Dish.find(params[:dish_id])
    if dish.destroy