07-rails/goodfoodhunting/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["dish_id", 4], ["created_at", 2017-03-22 00:59:15 UTC], ["updated_at", 2017-03-22 00:59:15 UTC]]
---
  def create
    like = Like.new
    like.dish_id = params[:dish_id]
    like.user_id = session[:user_id]
    like.save

INSERT INTO "likes" ("user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["dish_id", 10], ["created_at", 2017-03-22 04:45:59 UTC], ["updated_at", 2017-03-22 04:45:59 UTC]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."dish_id" = $1  [["dish_id", 11]]
---
  def api_create

    like = Like.new
    like.dish_id = params[:dish_id]
    like.user_id = session[:user_id]
    like.save
    render json: {likes_count: like.dish.likes.count} #like.dish.likes.count